function [p,dp]=simit_l(sita,Nmax)
%%
% 说明
%功能：计算n阶m次的缔合勒让德多项式及多项式对余纬的导数
% 输入：sita为地心余纬，数值上等于90度减去地心纬度，单位rad
%           Nmax为高斯球谐级数的最大截断阶数
%输出： p为归一化的缔合勒让德多项式，dp为多项式对余纬sita的导数
%参考：WORD文档《基于磁强计卫星完全自主定轨》或者张涛博士论文

%%
%程序结果说明
%对p矩阵的说明，通过前面的计算和最后的合并，结果为
%p的行为n，n=1,2，，，12，共12行
%p的列为m，m=0,1,2，，，12，共13列
%dp同理

%% 计算过程

 N=Nmax;

%----------------------带谐项（m=0）用p1表示-------------------------------%
p1=zeros(1,N+1);%虽然地磁场矢量的级数公式中n从1到12，但是为了递推，需要知道n等于0时的值，所以共13个
p1(1)=1;
p1(2)=cos(sita);
%公式说明：下面的循环结构中的递推式虽然在表面上和文件中的公式形式上不一样，但是本质上是一样的
%                 造成这种问题的原因为：文件中的n是从0开始的，而MATLAB的角标必须从1开始
%                 为了使递推公式在本质上等价，这样理解公式的处理：首先是角标，对于p1(1)，p1(2)等中的角标，
%                 只认为该数组为了存储新的数而更新角标，与真正的n没有关系，当使用数组中的数时，能够对应即可
%                 而公式表达式中，为了使当前计算的数与文件中的n相一致，需要让i-1=n
%                 如果依然用原来的公式，由于原始的P0和P1，变为了现在的P1和P2，导致了公式已经不适用了
for i=3:N+1
    p1(i)=((2*i-3)/(i-1))*cos(sita)*p1(i-1)-((i-2)/(i-1))*p1(i-2);
end

dp1=zeros(1,N+1);
dp1(1)=0;
dp1(2)=-sin(sita);

for i=3:N+1
    dp1(i)=((2*i-3)/(i-1))*(-sin(sita)*p1(i-1)+cos(sita)*dp1(i-1))-((i-2)/(i-1))*dp1(i-2);
end
%-------------------------------------------------------------------------%

%----------------------扇谐项（m=n）用p2表示-------------------------------%
p2=zeros(1,N);
p2(1)=sin(sita);

for i=2:N 
    p2(i)=sqrt((2*i-1)/(2*i))*sin(sita)*p2(i-1);
end

dp2=zeros(1,N);
dp2(1)=cos(sita);

for i=2:N
    dp2(i)=sqrt((2*i-1)/(2*i))*(cos(sita)*p2(i-1)+sin(sita)*dp2(i-1));
end
%-------------------------------------------------------------------------%  

%------------------------田谐项（m<n）用p3表示-----------------------------%
%在这部分，n和m的角标与它们对应的阶数和级数是一致的。先不考虑m=0的项，最后再通过扩维矩阵合并m=0的情况
 p3=zeros(N,N);

for i=1:N-1%n=m+1
    p3(i+1,i)=sqrt(2*i+1)*cos(sita)*p2(i);
end

for i=1:N
    p3(i,i)=p2(i);     %将p2项归入到p3项中，如p3(1,1)=p2(1),方便后续计算
end

 dp3=zeros(N,N);
 
for i=1:(N-1)%n=m+1
    dp3(i+1,i)=sqrt(2*i+1)*(-sin(sita)*p2(i)+cos(sita)*dp2(i));
end

for i=1:N
    dp3(i,i)=dp2(i);   %将dp2项归入到dp3项中，如dp3(1,1)=dp2(1),方便后续计算
end

%n>m+1
for i=1:(N-2)%i代表m,j代表n(列固定，循环行)
    for j=(i+2):N
        p3(j,i)=((2*j-1)/sqrt(j^2-i^2))*cos(sita)*p3(j-1,i)-sqrt(((j-1)^2-i^2)/(j^2-i^2))*p3(j-2,i);
    end
end

%n>m+1
for i=1:(N-2)
    for j=(i+2):N
        dp3(j,i)=((2*j-1)/sqrt(j^2-i^2))*(-sin(sita)*p3(j-1,i)+cos(sita)*dp3(j-1,i))-sqrt(((j-1)^2-i^2)/(j^2-i^2))*dp3(j-2,i);
    end
end
%-------------------------完成勒让德多项式的计算---------------------------%

p=[p1(2:N+1)',p3];      %p1数据组成了行，转置为列。然后把所有的勒让德多项式存入矩阵以供调用
dp=[dp1(2:N+1)',dp3];

%%
%程序结果说明
%对p矩阵的说明，通过前面的计算和最后的合并，结果为
%p的行为n，n=1,2，，，12，共12行
%p的列为m，m=0,1,2，，，12，共13列

